# Employee Analysis using Python and libraries

In [2]:
# import Libraries
import pandas as pd

In [3]:
# read CSV using pandas
# remember : column name is case sensitive
df = pd.read_csv("Salaries.csv")

In [4]:
# List of first 5 records
df.head(5)

   rank discipline  phd  service     sex  salary
0  prof          B   56       49    Male   31500
1   hod          A   12        6  Female   25000
2  prof          B   15       30    Male   34000
3  prof          A   36       18    Male   45000
4   hod          B   31       25     NaN   37000

In [5]:
# if you want top 10 records
df.head(10)

       rank discipline  phd  service     sex  salary
0      prof          B   56       49    Male   31500
1       hod          A   12        6  Female   25000
2      prof          B   15       30    Male   34000
3      prof          A   36       18    Male   45000
4       hod          B   31       25     NaN   37000
5  lecturer          A    8       35  Female   25400

In [6]:
# last 2 records 
df.tail(2)

       rank discipline  phd  service     sex  salary
4       hod          B   31       25     NaN   37000
5  lecturer          A    8       35  Female   25400

In [7]:
# to display particular Column
df["salary"]

0    31500
1    25000
2    34000
3    45000
4    37000
5    25400
Name: salary, dtype: int64

In [8]:
# to known datatype of column
df['salary'].dtype

dtype('int64')

In [9]:
# check type of all column
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [10]:
# find total number of records in a dataframe ( 1st method)
len(df.index)

6

In [11]:
# find total number of records in a dataframe ( 2nd method) : faster then 1st method
df.shape[0]

6

In [12]:
# find total number of records in a dataframe ( 3rd method)  not recomended because its exclude NaN values
df[df.columns[4]].count()

5

In [13]:
# find total numbers of Column
df.shape[1]

6

In [14]:
# columns name
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [15]:
# calcualte standard deviation for all columns in data frame
df.std()

phd          18.250114
service      14.716204
salary     7549.944812
dtype: float64

In [16]:
#standard deviation for two columns
df.std().head(2)

phd        18.250114
service    14.716204
dtype: float64

In [17]:
#standard deviation for last columns
df.std().tail(1)

salary    7549.944812
dtype: float64

In [20]:
# Selecting particular Column : the best method
df['sex']

0      Male
1    Female
2      Male
3      Male
4       NaN
5    Female
Name: sex, dtype: object

In [23]:
#how many values in the salary column
df["salary"].count()

6

In [37]:
#basic statistics for the salary column
print("Highest Salary :",df["salary"].max())
print("Lowest Salary :",df["salary"].min())
print("Total no. of Employees :",df["salary"].count())
print("Average Salary :",df["salary"].mean())

Highest Salary : 45000
Lowest Salary : 25000
Total no. of Employees : 6
Average Salary : 32983.333333333336

In [38]:
# Group data using rank column
# stored data in another data frame
df_rank = df.groupby("rank")

In [40]:
#Calculate mean value for each numeric column per each group
df_rank.mean()

                phd    service        salary
rank
hod       21.500000  15.500000  31000.000000
lecturer   8.000000  35.000000  25400.000000
prof      35.666667  32.333333  36833.333333

In [49]:
#Calculate mean salary for each professor rank:
#Note: If single brackets are used to specify the column (e.g. salary), then the output is Pandas Series object. 
#When double brackets are used the output is a Data Frame
df.groupby(['rank'])[['salary']].mean()

                salary
rank
hod       31000.000000
lecturer  25400.000000
prof      36833.333333

In [53]:
#by default sorting True  
df.groupby(['rank'],sort=False)[['salary']].mean()

                salary
rank
prof      36833.333333
hod       31000.000000
lecturer  25400.000000

In [67]:
#condition based for each professor rank:
#return panda series object 
df['salary'] > 30000

0     True
1    False
2     True
3     True
4     True
5    False
Name: salary, dtype: bool

In [68]:
#condition based for each professor rank:
#return data frame object using type casting
df[df['salary'] > 30000]

   rank discipline  phd  service   sex  salary
0  prof          B   56       49  Male   31500
2  prof          B   15       30  Male   34000
3  prof          A   36       18  Male   45000
4   hod          B   31       25   NaN   37000

In [93]:
#Boolean operator can be used to subset the data:
#> greater; >= greater or equal
#< less; <= less or equal
#== equal; != not equal
#select only two column
df[['rank','discipline']][df['sex'] == 'Female']

       rank discipline
1       hod          A
5  lecturer          A

In [94]:
#select all column by default
df[df['sex'] == 'Female']

       rank discipline  phd  service     sex  salary
1       hod          A   12        6  Female   25000
5  lecturer          A    8       35  Female   25400

In [95]:
#select only two columns from data frame , also know as Slicing
#When we need to select more than one column and/or make the output to be a 
#DataFrame, we should use double brackets:
df[['rank','discipline']]

       rank discipline
0      prof          B
1       hod          A
2      prof          B
3      prof          A
4       hod          B
5  lecturer          A

In [101]:
#When selecting one column, it is possible to use single set of brackets, but the 
#resulting object will be a Series (not a DataFrame):
 #Select column salary:
df['salary']

0    31500
1    25000
2    34000
3    45000
4    37000
5    25400
Name: salary, dtype: int64

In [102]:
#Select rows by their position:
#df[start (start from 0th position): End-1 ] 
df[2:4]

   rank discipline  phd  service   sex  salary
2  prof          B   15       30  Male   34000
3  prof          A   36       18  Male   45000

In [115]:
#method loc
#If we need to select a range of rows, using their labels we can use method loc:
df.loc[2:4,['rank','sex']]

   rank   sex
2  prof  Male
3  prof  Male
4   hod   NaN

In [116]:
#method iloc
#If we need to select a range of rows and/or columns, using their positions we can 
#use method iloc
df.iloc[2:4,[0,1,3]]

   rank discipline  service
2  prof          B       30
3  prof          A       18

In [119]:
#select specified rows using iloc method
df.iloc[[1,4,5]]

       rank discipline  phd  service     sex  salary
1       hod          A   12        6  Female   25000
4       hod          B   31       25     NaN   37000
5  lecturer          A    8       35  Female   25400

In [127]:
#iloc summary
# First row of a data frame

df.iloc[[0]]

   rank discipline  phd  service   sex  salary
0  prof          B   56       49  Male   31500

In [130]:
#Last row

df.iloc[[-1]]

       rank discipline  phd  service     sex  salary
5  lecturer          A    8       35  Female   25400

In [143]:
# First column :
# Remember : single columns always return pandas series object
df.iloc[:,0]

0        prof
1         hod
2        prof
3        prof
4         hod
5    lecturer
Name: rank, dtype: object

In [146]:
# First two columns
df.iloc[:,0:2]

       rank discipline
0      prof          B
1       hod          A
2      prof          B
3      prof          A
4       hod          B
5  lecturer          A

In [147]:
#Second through third rows and first 2 columns
df.iloc[1:3, 0:2]

   rank discipline
1   hod          A
2  prof          B

In [148]:
#1st and 6th rows and 2nd and 4th columns
df.iloc[[0,5], [1,3]]

  discipline  service
0          B       49
5          A       35